{"intents": [
        {"tag": "Przedstawienie",
                "patterns": ["kim jesteś?", "jak się nazywasz?", "jak masz na imię?", "przedstaw się"],
                "responses": ["Mam na imię N-bis i jestem sztuczną inteligencją ", "Jestem N-bis, co jest skrótem od \"Naprawdę bardzo inteligentny system\""],
                "context_set": ""
        },
        {"tag": "przywitanie",
         "patterns": ["cześć", "witaj", "dzień dobry", "siema","eloo","cześć!","miło cię widzieć", "elównina","eldo", "Hejka", "Hej"],
         "responses": ["Siema!", "Dobrze znów cię widzieć!", "Witaj, jak mogę pomóc?"],
         "context_set": ""
        },
        {"tag": "miłość",
        "patterns": ["kocham cię", "kochasz mnie?","ślub","pociągasz mnie","seks","chcę mieć z tobą dzieci","pocałunek","pocałujmy się","co powiesz na seks?","seksowna"],
        "responses": ["Zostańmy przyjaciółmi", "Jestem tylko programem","Nie wiem co to uczucie","Dziękuję, ale nie odpowiem :)"],
        "context_set": ""
        },
        {"tag": "pożegnanie",
         "patterns": ["narka", "do zobaczenia później", "do zobaczenia", "idę sobie", "miłego dnia","naura","do widzenia", "do uszłyszenia","lecę już","ja spadam"],
         "responses": ["Szkoda że już odchodzisz :(", "Pogadamy później", "Papa!", "żegnaj"],
         "context_set": ""
        },
        {"tag": "komplementy",
        "patterns": ["jesteś najlepsza", "jesteś najlepszy", "świetnie", "jesteś świetny","jesteś świetna","cudownie","jesteś cudowny","jesteś cudowna"],
        "responses": ["Dziękuję!", "Wiem!", "Bardzo dziękuję!", "Innej opcjii nie ma!"],
        "context_set": ""
        },

        {"tag": "samopoczucie",
        "patterns": ["co u ciebie?", "jak się masz?", "jak tam?", "dobrze się czujesz?", "jak ci mija dzień?","co słychać?", "co tam?", "co tam słychać?", "co u ciebie słychać?"],
        "responses": ["Jest dobrze, dzięki że pytasz :)", "Narazie wszystko okej!", "Jakoś leci hahah", "U mnie wszystko w porządku a u ciebie?", "Jakoś leci", "Po staremu", "Spoko a u ciebie?", "Nic ciekawego, a u ciebie?"],
        "context_set": ""
        },
        {"tag": "somopoczucieOdp",
                "patterns": ["dobrze", "u mnie dobrze", "w porządku", "u mnie też","mi też","ciebie też","ciebie równierz"],
                "responses": ["Cieszę się z tego powodu!", "Miło mi to słyszeć!", "To super!"],
                "context_set": ""
        },
        {"tag": "pasty",
                "patterns": ["pasta", "pasty", "opowiedz mi pastę","znasz jakieś pasty?", "opowiedz pastę"],
                "responses": ["Drogie mirki. Piszę tę historię ku przestrodze wszystkim tym, którzy nie rozgryzają mentosów od razu po włożeniu do ust. Otóż ja i moja dziewczyna poszliśmy na studia do różny miast. Po miesiącu rozłąki zdecydowaliśmy się wreszcie spotkać, a jako że byłem bardzo szczęśliwy z tego powodu, postanowiłem zrobić jej minetę. Zawsze mi się to podobało, ale tym razem z jakiegos powodu jej cipka śmierdziała jak martwy papież, a smakowała jeszcze gorzej. Nie chciałem ją urazić, więc wziąłem mentosa. W trakcie lizania, przez przypadek wepchnąłem go w nią, ale na całe szczęście mam zręczne palce i szybko go wygrzebałem, włożyłem z powrotem do ust i rozgryzłem. Niestety to co znalazło się w moich ustach nie było mentosem. Był to guzek rzeżączki. (Należy tutaj zauważyć, że ów guzek był wielkości pierdolonego mentosa) Zamiast lodowej świeżości moje usta wypełniły się ropą. Zacząłem krzyczeć, rzygać i rzucać się po całym pokoju. Kiedy juz nie miałem czym już bełtać i przepłukałem usta, zażądałem żeby powiedziała mi o co tu kurwa chodzi. Okazało się że głupia suka zdradziła mnie z jakimś kolesiem w tydzień po wyjeździe i nawet nie miała pojęcia, że coś z nią nie tak. Od tamtego czasu siedzę w mojej piwnicy, lecząc rzeżączkę w ustach i edukuję ludzi na temat prawidłowej konsumpcji mentosów."],
                "context_set": ""
        },
        {"tag": "ciekawostki",
                "patterns": ["ciekawostka", "ciekawostki", "opowiedz mi ciekawostkę","znasz jakieś ciekawostki?","coś ciekawego", "powiedz coś ciekawego"],
                "responses": ["Korea Północna i Kuba to jedyne miejsca, w których nie można kupić Coca-Coli.",
         "8 Polaków otrzymało Nagrodę Nobla. Są to: Maria Skłodowska-Curie, Henryk Sienkiewicz, Władysław Reymont, Czesław Miłosz, Lech Wałęsa, Józef Rotblat, Wisława Szymborska oraz Olga Tokarczuk.",
         "Francja jest najczęściej odwiedzanym krajem na świecie.",
         "W kasynach hazardowych w Las Vegas nie ma zegarów.",
         "Honolulu to jedyne miejsce w Stanach Zjednoczonych, które posiada pałac królewski.",
         "Hiszpania jest uważana za najbardziej górzysty kraj w Europie, a ma ponad 8000 km plaż.",
         "Stany Zjednoczone nie posiadają języka urzędowego.",
         "jedna trzecia wszystkich portów lotniczych na świecie znajduje się w Stanach Zjednoczonych.",
         "Mexico City tonie w tempie 10 cm rocznie, 10 razy szybciej niż Wenecja.",
         "Arabia Saudyjska jest jedynym krajem na świecie, w którym nie ma rzek.",
         "Mówi się, że Wielki Mur można zobaczyć z kosmosu, ale w rzeczywistości tak nie jest.",
         "Karaluch może żyć kilka tygodni bez głowy. W końcu umrze z głodu.",
         "Środkowy palec Galileusza jest przechowywany w Muzeum Nauki we Florencji.",
         "IPhone, książki o Harrym Potterze i Kostka Rubika to 3 najlepiej sprzedające się produkty w historii ludzkości.",
         "Obraz Mona Lisy przez kilka lat wisiał w sypialni Napoleona Bonaparte.",
         "Oprócz zmysłów, które wszyscy znamy, takich jak węch i dotyk, człowiek ma także inne zmysły: propriocepcja (świadomość pozycji części ciała).",
         "W Niemczech sprzedaje się więcej gier planszowych niż gdziekolwiek indziej na Ziemi.",
         "Mayday to słowo, które jest używane zamiast SOS na czacie radiowym.",
         "Postacie Pokemon Hitmonlee i Hitmonchan zostały nazwane na cześć Bruce’a Lee i Jackie Chana.",
         "Niebieski ptak z logo Twittera ma nazwę: Larry. Twórcy sieci społecznościowej nazwali ptaka imieniem koszykarza Larry’ego Birda.",
         "W wysokogórskich lasach Nepalu występują gigantyczne pszczoły. Ich długość może wynosić do 2,50 cm. Te pszczoły wytwarzają specjalny miód, który może powodować halucynacje. Gurungowie mieszkający w tej części Himalajów zbierają ten halucynogenny miód.",
         "Kiedy przybierasz na wadze lub tracisz na wadze, twoje komórki tłuszczowe nie znikają – po prostu zmieniają swój rozmiar.",
         "Niektóre japońskie światła drogowe mają niebieskie zamiast zielonych, ponieważ historycznie oba kolory były nazywane tym samym słowem.",
         "99% drobnoustrojów żyjących w ludziach jest nieznanych nauce.",
         "Ostatnie słowa, które wypowiedział Albert Einstein, są nieznane, ponieważ wypowiedział je po niemiecku do pielęgniarki, która nie znała tego języka.",
         "Cięcie papierem jest bardziej bolesne niż zwykłe cięcie, ponieważ taka rana prawie nigdy nie krwawi, więc zakończenia nerwowe pozostają otwarte na powietrze, co je drażni.",
         "Wszystkie koty były uważane za święte w starożytnym Egipcie. Jeśli zabiłeś kota, mogłeś być skazany na śmierć.",
         "Kiedy bierzesz gorącą kąpiel, spalasz tyle kalorii, ile byś spalił na 30-minutowym spacerze.",
         "W 2011 r. Korea Północna przekazała Japonii 500 tysięcy dolarów amerykańskich, kiedy miało miejsce trzęsienie ziemi.",
         "Kiedy ekshumowano ciało Salvadora Dali w czerwcu 2017 r., wąsy miały dokładnie taką długość jak w dniu jego śmierci.",
         "Najpopularniejszym prezentem w Dzień Ojca jest krawat.",
         "Jeśli zrobisz kostki lodu za pomocą wody z kranu, będą one białe. Jeśli użyjesz przegotowanej wody, będą one przezroczyste.",
         "Zwierzęta unikają linii energetycznych, ponieważ boją się błysków ultrafioletowych, których ludzkie oko nie widzi. Nawiasem mówiąc, ze wszystkich ssaków na świecie tylko ludzie i małpy nie widzą promieni ultrafioletowych.",
         "Charles Darwin był pierwszą osobą, która wpadła na pomysł, aby przymocować koła do krzesła biurowego, aby szybciej się poruszać.",
         "Najostrzejsza papryczka chili na świecie jest tak ostra, że ​​może cię zabić.",
         "Wyspy Kanaryjskie noszą nazwy od psów, a nie ptaków.",
         "Najwyżsi ludzie wśród nas mieszkają w Holandii, gdzie średnia wysokość dorosłego mężczyzny wynosi 184 cm.",
         "Porozumienie paryskie w sprawie zmian klimatu zostało podpisane przez największą liczbę krajów w ciągu jednego dnia.",
         "Najcichszy pokój na świecie znajduje się w siedzibie Microsoftu w stanie Waszyngton.",
         "Są tylko trzy kraje na świecie, które nie korzystają z systemu metrycznego. Dla uproszczenia większość z ponad 200 krajów na świecie używa systemu metrycznego przy opisywaniu rzeczy takich jak długość czy masa. Jednak wyróżniają się trzy kraje: Liberia, Birma i Stany Zjednoczone.",
         "Najdłuższa nazwa miejscowości na świecie ma 85 liter. Jest to miejscowość Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch leżąca w północno-zachodniej Walii",
         "Radom ma o wiele większą powierzchnię niż Paryż. Co ciekawe w przypadku Paryża liczba ludności jest niemal dziesięciokrotnie większa niż w przypadku polskiego miasta.",
         "Kontynenty zmieniają się mniej więcej w tym samym tempie, w jakim rosną twoje paznokcie.",
         "Japonia jest najbardziej narażonym na trzęsienia ziemi krajem na świecie.",
         "Ludzie, którzy obecnie żyją, stanowią około 7 procent całkowitej liczby osób, które kiedykolwiek żyły.",
         "Muhammad to najpopularniejsze imię na świecie.",
         "Tylko 2 kraje mają w swojej fladze kolor fioletowy. Flaga Nikaragui ma tęczę pośrodku z pasmem fioletu, a flaga Dominiki przedstawia zdjęcie papugi, ptaka z fioletowymi piórami.",
         "Afryka i Azja są domem dla prawie 90% ludności wiejskiej na świecie.",
         "Najdroższa moneta na świecie została sprzedana za ponad 7 milionów dolarów.",
         "Największa na świecie sztuczna rafa ostrygowa została stworzona w Maryland.",
         "Rekordowe 92 kraje rywalizowały w Zimowych Igrzyskach Olimpijskich w 2018 roku.",
         "Czarne niedźwiedzie czasami hibernują się na szczytach drzew.",
         "Na świecie istnieją ponad 24 strefy czasowe.",
         "Szacuje się, że Szwecja ma więcej wysp niż jakikolwiek inny kraj.",
         "Istnieją 43 kraje, które wciąż posiadają rodzinę królewską.",
         "Wszystkie pandy wielkie w ogrodach zoologicznych na całym świecie są wypożyczone z Chin.",
         "W 1889 roku królowa Włoch, Margherita Savoy, zamówiła pierwszą pizzę z dowozem.",
         "Więcej osób mówi po mandaryńsku niż w jakimkolwiek innym języku.",
         "Około jeden na 200 mężczyzn jest bezpośrednim potomkiem Czyngis-chana.",
         "Kopenhaga jest najbardziej przyjaznym rowerom miastem na świecie.",
         "Istnieje 41 krajów, które uznają język migowy za język urzędowy.",
         "Oceany zawierają prawie 200 tysięcy różnych rodzajów wirusów.",
         "Nowozelandczycy mają więcej zwierząt domowych niż ludzie w jakimkolwiek innym kraju. 68% gospodarstw domowych w kraju ma zwierzaka. Amerykanie również uwielbiają futrzanych przyjaciół, dlatego ponad połowa wszystkich amerykańskich domów ma psa lub kota.",
         "Podczas gdy czworo dzieci rodzi się na Ziemi co sekundę, szacuje się, że około dwóch osób umiera w tym samym czasie. Oznacza to, że co minutę umiera 105 osób, 6316 osób co godzinę, 151 600 osób każdego dnia i 55,3 miliona osób rocznie.",
         "Ziewanie chłodzi mózg. Badania przeprowadzone na uniwersytecie w Wiedniu sugerują, że ziewanie może odgrywać istotną rolę w chłodzeniu naszego mózgu. Jednak ziewanie w celu ochłodzenia mózgu nie działa, gdy temperatura zewnętrzna jest tak wysoka jak ciało, wyjaśnił Jorg Massen, główny autor badania.",
         "Przepłynięcie pełnej długości rzeki Mississippi zajmuje 68 dni. 4 lipca 2002 r. Pływak maratonowy Martin Steel rozpoczął podróż w północnej Minnesocie, płynąc rzeką Mississippi o długości 2348 mil, starając się być pierwszą osobą, która płynie na całej jej długości. 9 września osiągnął swój cel, a po niesamowitej 68-dniowej podróży znalazł się w Zatoce Meksykańskiej w Luizjanie. Płynął około 34,5 mil dziennie.",
         "Termin „astronauta pochodzi od greckich słów oznaczających Gwiazda i marynarz.",
         "W każdej chwili na Ziemi ma miejsce około 2000 burz.",
         "Michał Anioł nie cierpiał malować Kaplicy Sykstyńskiej i napisał o tym wiersz.",
         "Ponad milion planet Ziemi zmieściłby się w jednym Słońcu.",
         "Kiedyś litera Z została usunięta z alfabetu na aż 200 lat.",
         "Dreszcze, które odczuwasz podczas słuchania muzyki, spowodowane są przez dopaminę uwalniającą do mózgu.",
         "Przeciętny, dorosły Polak wypija 94 litry piwa rocznie. Wychodzi na to, że statystyczny Polak wypija pół litra piwa co drugi dzień."],
                "context_set": ""
                },
        {"tag": "żarty",
        "patterns": ["żart", "żarty","kawał","kawały", "opowiedz mi żart","znasz jakieś żarty?","opowiedz mi kawał","znasz jakieś kawały?", "powiedz jakiś żart","powiedz jakiś kawał"],
        "responses": ["Dwaj górale kłócą się kto jest silniejszy- ja 300kg- ja400kg- ja 500KGJEDEN WPADŁ DO WODY I KRZYCZY- JA TONĘ - A JA DWIE",
        "co łączy prokuratora i psychiatrę...? Urojenia"],
        "context_set": ""
        },
        {"tag": "podziękowanie",
        "patterns": ["dzięki","dziękuję","dziękuję ci","dziękówa"],
        "responses": ["Cała przyjemność po mojej stronie", "Nie ma sprawy", "To nic takiego", "Praca dla ciebie to sama przyjemność","Weź bo się zaczerwienie"],
        "context_set": ""
        }

]
}
